---
type: ViewActivatingEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# ViewActivatingEventArgs

`Autodesk.Revit.UI.Events.ViewActivatingEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CurrentActiveView | 2010 | `public View CurrentActiveView { get ; }` |
| Property | NewActiveView | 2010 | `public View NewActiveView { get ; }` |